# IsEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..IsEmpty Property
MEPSystem Class See Also
---
Indicates if the system is empty or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsEmpty { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEmpty {
	bool get ();
}
```

# Remarks
returns true if the system doesn't contain any components
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace